using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using System;
using ArabicSupport;

public class addTweetsFromArray : MonoBehaviour {

    public GameObject tweetManager;
    int firstFrame;
    int index;
    string[] azkar;
    // Use this for initialization
    void Start()
    {
        firstFrame = Time.frameCount;
        index = 0;
        char[] delimiterChars = { ',', '.', ':', ';', '،' };
        string nass = ArabicFixer.Fix("الإخلاص،الإخلاص،الإخلاص،الفلق،الفلق،الفلق،الناس.الناس.الناس. أصبحنا وأصبح الملك لله، والحمد لله، لا إله إلا الله، وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، ربِّ أسألك خير ما في هذا اليوم، وخير ما بعده، وأعوذ بك من شر هذا اليوم وشر ما بعده، رب أعوذ بك من الكسل وسوء الكِبر، ربِّ أعوذ بك من عذاب في النار، وعذاب في القبر. اللهم أنت ربي، لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شرِّ ما صنعت، أبوء لك بنعمتك عليّ، وأبوء بذنبي، فاغفر لي؛ فإنه لا يغفر الذنوب إلا أنت. رضيتُ بالله ربًّا، وبالإسلام دينًا، وبمحمد - صلى الله عليه وسلم - نبيًّا. رضيتُ بالله ربًّا، وبالإسلام دينًا، وبمحمد - صلى الله عليه وسلم - نبيًّا. رضيتُ بالله ربًّا، وبالإسلام دينًا، وبمحمد - صلى الله عليه وسلم - نبيًّا. اللهم إني أصبحت أشهدك، وأشهد حملة عرشك، وملائكتك، وجميع خلقك، أنك أنت الله لا إله إلا أنت، وحدك لا شريك لك، وأن محمدًا عبدك ورسولك.اللهم إني أصبحت أشهدك، وأشهد حملة عرشك، وملائكتك، وجميع خلقك، أنك أنت الله لا إله إلا أنت، وحدك لا شريك لك، وأن محمدًا عبدك ورسولك.اللهم إني أصبحت أشهدك، وأشهد حملة عرشك، وملائكتك، وجميع خلقك، أنك أنت الله لا إله إلا أنت، وحدك لا شريك لك، وأن محمدًا عبدك ورسولك.اللهم إني أصبحت أشهدك، وأشهد حملة عرشك، وملائكتك، وجميع خلقك، أنك أنت الله لا إله إلا أنت، وحدك لا شريك لك، وأن محمدًا عبدك ورسولك. اللهم ما أصبح بي من نعمة، أو بأحد من خلقك، فمنك وحدك لا شريك لك، فلك الحمد ولك الشكر. حسبي الله لا إله إلا هو، عليه توكَّلت وهو رب العرش العظيم.حسبي الله لا إله إلا هو، عليه توكَّلت وهو رب العرش العظيم.حسبي الله لا إله إلا هو، عليه توكَّلت وهو رب العرش العظيم.حسبي الله لا إله إلا هو، عليه توكَّلت وهو رب العرش العظيم.حسبي الله لا إله إلا هو، عليه توكَّلت وهو رب العرش العظيم.حسبي الله لا إله إلا هو، عليه توكَّلت وهو رب العرش العظيم.حسبي الله لا إله إلا هو، عليه توكَّلت وهو رب العرش العظيم. بسم الله الذي لا يضر، مع اسمه شيء في الأرض ولا في السماء، وهو السميع العليم. بسم الله الذي لا يضر، مع اسمه شيء في الأرض ولا في السماء، وهو السميع العليم. بسم الله الذي لا يضر، مع اسمه شيء في الأرض ولا في السماء، وهو السميع العليم. اللهم بك أصبحنا وبك أمسينا، وبك نحيا وبك نموت وإليك النشور. أصبحنا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد، صلى الله عليه وسلم ، وعلى مِلة أبينا إبراهيم حنيفًا مسلمًا، وما كان من المشركين. سبحان الله وبحمده عدد خلقه، ورضا نفسه، وزنة عرشه، ومداد كلماته. سبحان الله وبحمده عدد خلقه، ورضا نفسه، وزنة عرشه، ومداد كلماته. سبحان الله وبحمده عدد خلقه، ورضا نفسه، وزنة عرشه، ومداد كلماته. اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت. اللهم إني أعوذ بك من الكفر والفقر، وأعوذ بك من عذاب القبر، لا إله إلا أنت. اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت. اللهم إني أعوذ بك من الكفر والفقر، وأعوذ بك من عذاب القبر، لا إله إلا أنت. اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت. اللهم إني أعوذ بك من الكفر والفقر، وأعوذ بك من عذاب القبر، لا إله إلا أنت. اللهم إني أسألك العفو والعافية، في الدنيا والآخرة، اللهم إني أسألك العفو والعافية، في ديني ودنياي وأهلي ومالي، اللهم استر عوراتي وآمن روعاتي، اللهم احفظني من بين يدي ومن خلفي، وعن يميني وعن شمالي، ومن فوقي، وأعوذ بعظمتك أن أغتال من تحتي. يا حيّ يا قيوم، برحمتك أستغيث، أصلح لي شأني كله، ولا تَكِلني إلى نفسي طرْفة عين. أصبحنا وأصبح الملك لله رب العالمين، اللهم إني أسألك خير هذا اليوم فتحه، ونصره، ونوره وبركته وهداه، وأعوذ بك من شر ما فيه وشر ما بعده. اللهم عالم الغيب والشهادة، فاطر السماوات والأرض، رب كل شيء ومليكه، أشهد أنْ لا إله إلا أنت، أعوذ بك من شر نفسي، ومن شر الشيطان وشركه، وأن أقترف على نفسي سوءًا، أو أجره إلى مسلم. أعوذ بكلمات الله التامات من شر ما خلق. أعوذ بكلمات الله التامات من شر ما خلق.  أعوذ بكلمات الله التامات من شر ما خلق. اللهم صلِّ وسلم على نبينا محمد.  اللهم صلِّ وسلم على نبينا محمد.  اللهم صلِّ وسلم على نبينا محمد.  اللهم صلِّ وسلم على نبينا محمد.  اللهم صلِّ وسلم على نبينا محمد.  اللهم صلِّ وسلم على نبينا محمد.  اللهم صلِّ وسلم على نبينا محمد.  اللهم صلِّ وسلم على نبينا محمد.  اللهم صلِّ وسلم على نبينا محمد.  اللهم صلِّ وسلم على نبينا محمد. اللهم إنا بك نعوذ أن نشرك بك شيئًا نعلمه، ونستغفرك لما لا نعلمه. اللهم إنا نعوذ بك أن نشرك بك شيئًا نعلمه، ونستغفرك لما لا نعلمه. اللهم إنا نعوذ بك أن نشرك بك شيئًا نعلمه، ونستغفرك لما لا نعلمه. اللهم إنى أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلَبة الدَّين وقهر الرجال. أستغفر الله العظيم، الذي لا اله الا هو، الحي القيوم وأتوب اليه. أستغفر الله العظيم، الذي لا اله الا هو، الحي القيوم وأتوب اليه. أستغفر الله العظيم، الذي لا اله الا هو، الحي القيوم وأتوب اليه. اللهم إني أسألك علمًا نافعًا، ورزقًا طيبًا وعملًا متقبلًا") ;
        azkar = nass.Split(delimiterChars);
        Array.Reverse(azkar);
        //print(azkar[0]);
        //print(azkar.Length);
    }

    // Update is called once per frame
    void Update()
    {
        if (((Time.frameCount - firstFrame) % 1 == 0) && (Time.frameCount - firstFrame) > 0 && index<azkar.Length)
        {
            //            print("hi");
            tweetManager.GetComponent<createAndArrangeButtons>().addNewTweet("Me", Reverse((azkar[index])));
            index++;
        }
    }

    //public static string Reverse(string s)
    //{
    //    char[] charArray = s.ToCharArray();
    //    Array.Reverse(charArray);
    //    return new string(charArray);
    //}

    public static string Reverse(string s)
    {
        char[] delimiterChars = {',', '.', ':',';','،'};
        string[] words = s.Split(delimiterChars);
        string outputStr = "";

        for (int i = 0; i < words.Length; i++)
        {
            //print(outputStr);
            outputStr = outputStr + "\n" + words[words.Length-(i+1)];
        }
        return outputStr;
    }
}